<a href="https://colab.research.google.com/github/michelleruas/Data_Visualisation/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Pandas

In [1]:
#Import libraries
import pandas as pd
import numpy as np

In [2]:
#Series and Dataframes
s = pd.Series(np.random.rand(4), name = 'daily_returns')
s

0    0.767540
1    0.674429
2    0.209019
3    0.876142
Name: daily_returns, dtype: float64

In [3]:
s*100

0    76.754039
1    67.442885
2    20.901903
3    87.614175
Name: daily_returns, dtype: float64

In [4]:
np.abs(s)

0    0.767540
1    0.674429
2    0.209019
3    0.876142
Name: daily_returns, dtype: float64

In [6]:
#Method that generate statistics that represent the data excluding NaN values
s.describe()

count    4.000000
mean     0.631783
std      0.293649
min      0.209019
25%      0.558076
50%      0.720985
75%      0.794691
max      0.876142
Name: daily_returns, dtype: float64

In [7]:
s.index = ["AMZN" , "AAPL", "TSLA", "GOOG"]
s

AMZN    0.767540
AAPL    0.674429
TSLA    0.209019
GOOG    0.876142
Name: daily_returns, dtype: float64

In [8]:
"AAPL" in s

True

#Dataframes

In [11]:
from google.colab import files
uploaded = files.upload()

Saving avocado.csv to avocado.csv

  school;sex;age;address;famsize;Pstatus;Medu;Fedu;Mjob;Fjob;reason;guardian;traveltime;studytime;failures;schoolsup;famsup;paid;activities;nursery;higher;internet;romantic;famrel;freetime;goout;Dalc;Walc;health;absences;G1;G2;G3
0  GP;"F";18;"U";"GT3";"A";4;4;"at_home";"teacher...
1  GP;"F";17;"U";"GT3";"T";1;1;"at_home";"other";...
2  GP;"F";15;"U";"LE3";"T";1;1;"at_home";"other";...

In [12]:
df = pd.read_csv("avocado.csv")
df.head(3)

   Unnamed: 0        Date  AveragePrice  ...          type  year  region
0           0  2015-12-27          1.33  ...  conventional  2015  Albany
1           1  2015-12-20          1.35  ...  conventional  2015  Albany
2           2  2015-12-13          0.93  ...  conventional  2015  Albany

[3 rows x 14 columns]

In [13]:
df

       Unnamed: 0        Date  ...  year            region
0               0  2015-12-27  ...  2015            Albany
1               1  2015-12-20  ...  2015            Albany
2               2  2015-12-13  ...  2015            Albany
3               3  2015-12-06  ...  2015            Albany
4               4  2015-11-29  ...  2015            Albany
...           ...         ...  ...   ...               ...
18244           7  2018-02-04  ...  2018  WestTexNewMexico
18245           8  2018-01-28  ...  2018  WestTexNewMexico
18246           9  2018-01-21  ...  2018  WestTexNewMexico
18247          10  2018-01-14  ...  2018  WestTexNewMexico
18248          11  2018-01-07  ...  2018  WestTexNewMexico

[18249 rows x 14 columns]

In [14]:
#Slicing
df[2:5]

   Unnamed: 0        Date  AveragePrice  ...          type  year  region
2           2  2015-12-13          0.93  ...  conventional  2015  Albany
3           3  2015-12-06          1.08  ...  conventional  2015  Albany
4           4  2015-11-29          1.28  ...  conventional  2015  Albany

[3 rows x 14 columns]

In [15]:
df[['Date', 'AveragePrice']]

             Date  AveragePrice
0      2015-12-27          1.33
1      2015-12-20          1.35
2      2015-12-13          0.93
3      2015-12-06          1.08
4      2015-11-29          1.28
...           ...           ...
18244  2018-02-04          1.63
18245  2018-01-28          1.71
18246  2018-01-21          1.87
18247  2018-01-14          1.93
18248  2018-01-07          1.62

[18249 rows x 2 columns]

In [17]:
df.iloc[2:5, 0:4]

   Unnamed: 0        Date  AveragePrice  Total Volume
2           2  2015-12-13          0.93     118220.22
3           3  2015-12-06          1.08      78992.15
4           4  2015-11-29          1.28      51039.60